#+title: My Emacs Configuration
#+AUTHOR: =Tung Xuan=
#+EMAIL: mxt.tung@gmail.com
#+SUBTITLE: Emacs configuration for work and life
#+setupfile: headers
#+property: header-args:emacs-lisp+ :tangle ./init.el

* UI Config
#+begin_src emacs-lisp
  (setq-default font-lock-multiline nil)

				 ;;; better defaults
  (set-language-environment "utf-8")
  (set-default-coding-systems 'utf-8)
  (setq default-input-method nil)

			     ;;; undo
  (setq undo-limit        10000000 ;; 1mb (default is 160kb)
	undo-strong-limit 100000000 ;; 100mb (default is 240kb)
	undo-outer-limit  1000000000) ;; 1gb (default is 24mb)

  ;; set fullscreen
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  ;; better simple ui
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (blink-cursor-mode 0)

  (setq-default frame-title-format "%b - Emacs")

  (use-package catppuccin-theme
    :straight (:build t)
    :ensure t
					  ;config
					  ;(setq catppuccin-flavor 'mocha)) ;; or 'latte, or 'frappe 'macchiato, or 'mocha 
    )

  (use-package doom-themes
    :straight (:build t)
    :ensure t
    :config
    (load-theme 'catppuccin t ))
					  ;(catppuccin-set-color 'base "#0d1117") ;; change base to #000000 for the currently active flavor
					  ;(catppuccin-set-color 'crust "#222222" 'frappe) ;; change crust to #222222 for frappe
					  ;(catppuccin-reload)

  (set-face-attribute 'default nil
		      :font "jetbrains mono"
		      :weight 'light
		      :height 140)

  ;; set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil
		      :font "jetbrains mono"
		      :weight 'light
		      :height 140)

  ;; set the variable pitch face
  (set-face-attribute 'variable-pitch nil
		      ;; :font "cantarell"
		      :font "jetbrains mono"
		      :height 140
		      :weight 'light)
  ;;(setq frame-title-format "")

  (require 'time)
  (setq display-time-format "%y-%b-%d %H:%M")
  (display-time-mode 1) 

  (use-package doom-modeline
    :straight t
    :custom
    (doom-modeline-height 35)
    (doom-modeline-bar-width 8)
    (doom-modeline-time-icon nil)
    (doom-modeline-buffer-encoding 'nondefault)
    (doom-modeline-unicode-fallback t))
  (setq evil-normal-state-tag   (propertize "[NORMAL]" 'face '((:background "greenyellow" :foreground "black")))
	evil-emacs-state-tag    (propertize "[EMACS]" 'face '((:background "orange" :foreground "black")))
	evil-insert-state-tag   (propertize "[INSERT]" 'face '((:background "red") :foreground "white"))
	evil-motion-state-tag   (propertize "[MOTION]" 'face '((:background "blue") :foreground "white"))
	evil-visual-state-tag   (propertize "[VISUAL]" 'face '((:background "yellow" :foreground "black")))
	evil-operator-state-tag (propertize "[OPERATOR]" 'face '((:background "purple"))))
  ;; use moody for the mode bar
  (use-package moody
    :straight (:build t)
    :config
    (setq x-underline-at-descent-line t)
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode))

  (use-package minions
    :straight (:build t)
    :config
    (setq minions-mode-line-lighter ""
	  minions-mode-line-delimiters '("" . ""))
    (minions-mode 1))
  (setq evil-insert-state-cursor '((bar . 2) "orange")
	evil-normal-state-cursor '(box "orange"))


					  ; display time in modeline

  (use-package rainbow-delimiters
    :straight (:build t)
    :defer t
    :hook (prog-mode . rainbow-delimiters-mode))

  ;; make esc quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  ;; enable line numbers for some modes
  (dolist (mode '(text-mode-hook
		  prog-mode-hook
		  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1)))) 

  (setq global-display-line-numbers-mode t)
  (setq tab-always-indent nil
	whitespace-action '(cleanup auto-cleanup))



#+end_src


#+RESULTS:
| rainbow-delimiters-mode |



